import { faChevronLeft } from "@fortawesome/pro-solid-svg-icons";
import { FontAwesomeIcon } from "@fortawesome/react-fontawesome";
import React, { useState } from "react";
import HeaderMobile from "../../assets/components/header";

const TermsAndConditions = () => {
    return (
        <div>
            <HeaderMobile firstLink="/my-account" firstIcon={faChevronLeft} title="ข้อกำหนดและเงื่อนไข" secondBtn={false}/>
            <main className="p-6">
                <h2 className="font-bold">ข้อกำหนดและเงื่อนไขการใช้ Hondanont Loyalty</h2>
                <p className="text-sm mt-3 font-medium" style={{color:"#585858"}}>
                บริษัท เอชซีเอ็น ฮอนด้า ออโตโมบิล จำกัด (“บริษัท”) ได้จัดทำ Hondanont Loyalty โดยใช้แพลตฟอร์ม LINE และ hondanont.zaviago.com รวมถึงเว็บไซต์  เว็บไซต์ที่แสดงบนอุปกรณ์มือถือ หรือโมบายแอพพลิเคชั่น (“แพลตฟอร์ม”) เพื่อใช้เป็นช่องทางในการติดต่อและสื่อสาร รวมถึงให้บริการแก่ผู้ใช้บริการที่เป็นสมาชิกของ Hondanont Loyalty  เช่น การสมัครเป็นสมาชิก ตรวจสอบแต้มคงเหลือ ปรับเปลี่ยนข้อมูลส่วนตัวของสมาชิก ตรวจสอบแคมเปญส่งเสริมการขายของบริษัท แลกแต้มสะสมตามรายการที่บริษัทกำหนด รวมถึงวัตถุประสงค์อื่น ๆ ตามที่บริษัทจะกำหนดขึ้นในภายหลัง<br/><br/>
                ผู้ใช้งานแพลตฟอร์ม (“ผู้ใช้งาน”)ได้อ่าน และยอมรับว่าผู้ใช้งานจะต้องผูกพันตามข้อกำหนดและเงื่อนไขที่กำหนดไว้ในแพลตฟอร์มนี้ โดยผู้ใช้งานจะต้องศึกษาข้อกำหนดและเงื่อนไขด้านล่างนี้อย่างละเอียดและรอบคอบก่อนที่จะกระทำธุรกรรมหรือกิจกรรมใด ๆ บนแพลตฟอร์มนี้ หากท่านทำธุรกรรมหรือกิจกรรมใด ๆ บนแพลตฟอร์ม ให้ถือว่าท่านได้ยอมรับและตกลงที่จะปฏิบัติตามข้อกำหนดและเงื่อนไขฉบับนี้แล้ว และหากท่านไม่ต้องการที่จะผูกพันภายใต้เงื่อนไขนี้ กรุณาหยุดทำธุรกรรมใด ๆ บนแพลตฟอร์มนี้  ทั้งนี้ บริษัทมีสิทธิที่จะแก้ไข เปลี่ยนแปลง หรือยกเลิกข้อกำหนดและเงื่อนไขนี้ และ/หรือข้อตกลงอื่น ๆ ในแพลตฟอร์มนี้ โดยไม่ต้องแจ้งให้สมาชิกและผู้ใช้งานทราบล่วงหน้า
                </p>

                <h2 className="font-bold mt-8">1. ขอบเขตการใช้งานแพลตฟอร์ม และข้อกำหนดทั่วไป</h2>
                <p className="text-sm mt-3 font-medium" style={{color:"#585858"}}>
                    1.1 บริษัทขอสงวนสิทธิไว้สำหรับสมาชิกที่ลงทะเบียนเป็นสมาชิกบน
                    แพลตฟอร์มเพื่อตรวจสอบแต้มคงเหลือและแต้มที่จะหมดอายุปรับ
                    เปลี่ยนข้อมูลส่วนตัวของสมาชิกตรวจสอบแคมเปญส่งเสริมการขาย
                    ของบริษัท แลกแต้มสะสมตามรายการที่บริษัทกำหนดรวมถึง
                    วัตถุประสงค์อื่น ๆ ตามที่บริษัทอาจกำหนดขึ้นในภายหลัง
                    <br/><br/>
                    1.2 ผู้ใช้งานรับรองว่าบรรดาข้อมูลที่ได้ให้ไว้แก่บริษัทในแพลตฟอร์ม
                    เป็นข้อมูลของผู้ใช้งานที่ถูกต้องครบถ้วนโดยเฉพาะอย่างยิ่งรับรอง
                    ว่าเบอร์โทรศัพท์มือถือ หรืออีเมลส่วนตัวยังใช้งานได้อยู่ในขณะที่
                    ให้ข้อมูลดังกล่าว
                    <br/><br/>
                    1.3 ผู้ใช้งานตกลงและรับทราบว่าบริษัทไม่ได้ให้ความรับรองถึงความ
                    ถูกต้องสมบูรณ์ของเนื้อหาที่ปรากฏอยู่บนแพลตฟอร์มและไม่รับรองว่า
                    แพลตฟอร์ม ปราศจากไวรัส หรือสิ่งอื่น ๆ ที่อาจจะกระทบต่ออุปกรณ์
                    เคลื่อนที่ของท่าน
                    <br/><br/>
                    1.4 ก่อนจะทำรายการใด ๆ ผ่านแพลตฟอร์ม ผู้ใช้งานจะต้องตรวจสอบ
                    ชื่อและนามสกุล หมายเลขบัตรประจำตัวประชาชนและแต้มสะสม ซึ่งจะ
                    ปรากฏบนแพลตฟอร์มและอีเมลที่ส่งถึงท่านตามอีเมลแอดเดรสหรือ
                    ข้อมูลส่วนบุคคลอื่นๆที่ใช้ในการการติดต่อที่ท่านได้ระบุไว้ หลังจากที่
                    มีการทำธุรกรรมใดๆ ผ่านทางแพลตฟอร์มทุกครั้ง
                    <br/><br/>
                    1.5 ผู้ใช้งานจะตรวจสอบเงื่อนไขเกี่ยวกับสิทธิประโยชน์อัตราการแลก
                    แต้ม รวมถึงการเข้าร่วมกิจกรรมต่าง ๆ ที่ปรากฏอยู่บนแพลตฟอร์ม
                    ก่อนการรับสิทธิประโยชน์ และการเข้าร่วมกิจกรรมต่าง ๆ ผ่านแพลตฟอร์ม
                    <br/><br/>
                    1.6 การใช้งานแพลตฟอร์มในแต่ละครั้ง ถือว่าผู้ใช้งานได้รับทราบถึง
                    ข้อตกลงและเงื่อนไขนี้รวมถึงข้อตกลงและเงื่อนไขทีมีการเปลี่ยนแปลง
                    แก้ไขและได้ใช้บังคับในเวลาดังกล่าวโดยครบถ้วนสมบูรณ์แล้วโดยตกลงปฏิบัติตามข้อตกลงและเงื่อนไขดังกล่าวทุกประการ
                    <br/><br/>
                    1.7 ผู้ใช้งานรับทราบว่าการเก็บรวบรวม ใช้ เปิดเผย หรือโอนข้อมูล
                    ส่วนบุคคลของผู้ใช้งานเป็นไปตามนโยบายความเป็นส่วนตัว
                    <br/><br/>
                    1.8 ในแพลตฟอร์มจะมีโฆษณา ไฮเปอร์ลิงก์ หรือดีพลิงก์ไปยังเว็บไซต์
                    หรือ แอพพลิเคชั่นของบุคคลที่สามรวมถึงแต่ไม่จำกัดเพียงลิงก์ไปยัง
                    แพลตฟอร์ม เวปไซต์ หรือแอพพลิเคชั่นของบริษัทที่อยู่ภายใต้เงื่อนไข
                    การใช้ข้อมูล ซึ่งแพลตฟอร์ม เวปไซต์ หรือแอพพลิเคชั่นของบุคคล
                    ที่สามเหล่านั้นไม่ถือเป็นส่วนหนึ่งของแพลตฟอร์มของบริษัท และไม่อยู่
                    ภายใต้การควบคุมหรือความรับผิดชอบของบริษัท เมื่อผู้ใช้งานทำการ
                    ลิงก์ไปยังแพลตฟอร์ม เวปไซต์ หรือแอพพลิเคชั่นดังกล่าว เมื่อผู้ใช้งาน
                    จะออกจากแพลตฟอร์มของบริษัทและดำเนินการต่อไปภายใต้ความเสี่ยงของผู้ใช้งานเองทั้งหมด บริษัทไม่รับประกันถึงความถูกต้องแม่นยำ
                    และความน่าเชื่อถือของข้อมูลที่ระบุไว้บนเว็บไซต์ของบุคคลที่สาม และ
                    บริษัทขอปฏิเสธความรับผิดชอบทั้งหมดต่อการสูญเสียหรือเสียหายที่
                    ผู้ใช้งานได้รับจากการอ้างอิงข้อความที่อยู่หรือไม่มีอยู่บนแพลตฟอร์ม เวปไซต์ หรือแอพพลิเคชั่นของบุคคลที่สาม การแสดงโฆษณาไม่ถือเป็น
                    การแสดงการรับรองหรือแนะนำจากบริษัท
                    <br/><br/>
                    1.9 ในกรณีที่มีเหตุอันสมควร บริษัทอาจระงับหรือยกเลิกการให้บริการ รวมถึงเปลี่ยนแปลงรายการส่งเสริมการขายผ่านแพลตฟอร์มได้โดยไม่ต้องประกาศ หรือแจ้งให้ทราบล่วงหน้า
                    <br/><br/>
                    1.10 แต้มสะสมที่ปรากฏเมื่อมีการตรวจสอบแต้มจะเป็นแต้มสะสมของ
                    การซื้อสินค้าและบริการครั้งล่าสุดของวันนี้แต้มจะถูกนำไปคำนวณและ
                    แสดงในวันถัดไป หรือตามเงื่อนไขของที่กำหนดไว้
                    <br/><br/>
                    1.11 แต้มสะสมที่แลกผ่านทางแพลตฟอร์มจะถูกนำไปประมวลผลและหักออกจากแต้มที่คงเหลืออยู่ทันที
                    <br/><br/>
                    1.12 ในการแลกแต้มบนแพลตฟอร์มผู้ใช้งานจะไม่ได้รับอีเมลสรุปการแลกแต้ม แต่สามารถตรวจสอบประวัติการแลกแต้มได้ที่เมนู "ประวัติการใช้งาน"
                    <br/><br/>
                    1.13 เมื่อผู้ใช้งานทำการยืนยันการแลกแต้มบนแพลตฟอร์มเรียบร้อยแล้ว จะไม่สามารถขอคืนแต้มได้
                    <br/><br/>
                    1.14 กรณีแลกแต้มผ่านช่องทางอื่น หากสมาชิกไม่ได้เป็นผู้ทำรายการ โปรดติดต่อ 02-591-7733-6  ต่อ 622 , 623 ภายใน 7 วัน หากเกินกำหนดเวลาและเกิดปัญหาโต้แย้งคำชี้ขาดของบริษัทถือเป็นที่สิ้นสุด
                    <br/><br/>
                    1.15 กรณีที่มีข้อโต้แย้งเกี่ยวกับแต้ม  ข้าพเจ้าตกลงและยอมรับให้บริษัทมีอำนาจในการตรวจสอบและปรับแต้มย้อนหลังไม่เกิน 6 เดือน และการตัดสินของบริษัทถือเป็นที่สิ้นสุด
                </p>
            </main>
        </div>
    )
}

export default TermsAndConditions;